CarltonYu/M5Cardputer-UserDemo/ESP32S3N16R8/sdkconfig.defaults
# ESP-IDF 5.4.x defaults for an ESP32-S3-N16R8 style board.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_WIFI_ENABLED=y

# Wi-Fi is initialized in STA mode only for ESP-NOW chat.
# Enable PSRAM later if a later port needs larger frame buffers or assets.
